/**
 * JavaDesignPattern.java
 */
package kr.pe.pattern;

/**
 * <pre>
 * 
 * 1. 생성 패턴
 *  -1. 추상 팩토리
 *  -2. 빌더
 *  -3. 팩토리 메서드
 *  -4. 프로토타입
 *  -5. 싱글턴
 * 
 * 2. 구조 패턴
 *  -1. 어댑터
 *  -2. 브리지
 *  -3. 복합체
 *  -4. 데코레이터
 *  -5. 퍼사드
 *  -6. 플라이웨이트
 *  -7. 프록시
 * 
 * 3. 행동 패턴
 *  -1. 책임 연쇄
 *  -2. 커맨드
 *  -3. 반복자
 *  -4. 중재자
 *  -5. 메멘토
 *  -6. 옵서버
 *  -7. 상태
 *  -8. 전략
 *  -9 템플릿 메서드
 *  -10. 비지터
 *  
 * PC  2026. 9. 8. 오전 10:32:01
 * </pre>
 */
public class JavaDesignPattern {

	/**
	 * <pre></pre>
	 * 
	 */
	public JavaDesignPattern() {
		super();
	}

}
