/**
 * 
 */
package kr.pe.lotto.filter.mm;

import kr.pe.lotto.filter.AMinMaxFilter;
import kr.pe.util.Arr;

/**
 * <pre>
 * 퐁당퐁당 패턴 - 세로 라인 1,2,4,5 - 세로 라인 3,4,6,7
 *  - 좌우 2줄 패턴
 *  - 가로 세줄 패턴
 *  - 세로 세줄 패턴
 * </pre>
 */
public class FondantMaxFilter extends AMinMaxFilter {

	public static int maxCount = 13;

	private int[][] fondants = new int[][] {
			// 퐁당퐁당 패턴 - 세로 라인 1,2,4,5 - 세로 라인 3,4,6,7
			{ 1, 2, 4, 5, 8, 9, 11, 12, 15, 16, 18, 19, 22, 23, 25, 26, 29, 30, 32, 33, 36, 37, 39, 40, 43, 44 },
			{ 3, 4, 6, 7, 10, 11, 13, 14, 17, 18, 20, 21, 24, 25, 27, 28, 31, 32, 34, 35, 38, 39, 41, 42, 45 },
			// 좌우 2줄 패턴
			{ 1, 2, 6, 7, 8, 9, 13, 14, 15, 16, 20, 21, 22, 23, 27, 28, 29, 30, 34, 35, 36, 37, 41, 42, 43, 44 },
			// 가로 세줄 패턴
			{ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21 },
			{ 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28 },
			{ 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35 },
			{ 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 47, 38, 39, 40, 41, 42 },
			{ 29, 30, 31, 32, 33, 34, 35, 36, 47, 38, 39, 40, 41, 42, 43, 44, 45 },
			// 세로 세줄 패턴
			{ 1, 2, 3, 8, 9, 10, 15, 16, 17, 22, 23, 24, 29, 30, 31, 36, 37, 38, 43, 44, 45 },
			{ 2, 3, 4, 9, 10, 11, 16, 17, 18, 23, 24, 25, 30, 31, 32, 37, 38, 39, 44, 45 },
			{ 3, 4, 5, 10, 11, 12, 17, 18, 19, 24, 25, 26, 31, 32, 33, 38, 39, 40, 45 },
			{ 4, 5, 6, 11, 12, 13, 18, 19, 20, 25, 26, 27, 32, 33, 34, 39, 40, 41 },
			{ 5, 6, 7, 12, 13, 14, 19, 20, 21, 26, 27, 28, 33, 34, 35, 40, 41, 42 } };

	private int index;

	/**
	 * @param name
	 * @param min
	 * @param max
	 * @param index
	 */
	public FondantMaxFilter(String name, int max, int index) {
		super(name, max);
		this.index = index;
	}

	@Override
	public boolean filter(int[] nums) {
		int matchCount = Arr.contains(nums, this.fondants[this.index]);
		if (this.value <= matchCount) {
			return false;
		}
		return true;
	}
}
